{"meta":{"title":"Chase's Blog","subtitle":"","description":"i love coding and wolffy","author":"Chase Tsai","url":"https://tsai-shiyuan.github.io","root":"/"},"pages":[{"title":"Categories","date":"2024-07-16T04:56:57.000Z","updated":"2025-06-05T10:56:30.879Z","comments":false,"path":"categories/index.html","permalink":"https://tsai-shiyuan.github.io/categories/index.html","excerpt":"","text":""},{"title":"About","date":"2024-07-16T05:01:21.000Z","updated":"2025-06-05T10:56:38.551Z","comments":true,"path":"about/index.html","permalink":"https://tsai-shiyuan.github.io/about/index.html","excerpt":"","text":""},{"title":"Tags","date":"2024-07-16T05:00:13.000Z","updated":"2025-06-05T10:56:43.440Z","comments":false,"path":"tags/index.html","permalink":"https://tsai-shiyuan.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"250622-期末季","slug":"250622-tough-semester","date":"2025-06-22T06:40:20.000Z","updated":"2025-06-22T07:00:34.612Z","comments":true,"path":"2025/06/22/250622-tough-semester/","permalink":"https://tsai-shiyuan.github.io/2025/06/22/250622-tough-semester/","excerpt":"","text":"又到期末季，下周一，其实就是明天，就要考机器学习了。平时不努力，考试徒伤悲。 这两周零零散散地看了PPT，然后从周六开始，又重新理了一下知识点，对着其他同学的笔记，又在纸上把公式写了写，又有了新的理解。还是边学边写的效率高。 又非常的后悔，为什么平时不多花点时间查资料，搞懂这些知识点呢？感觉错过好多哇。往后不要这么懒！ 复习累了就看 Heroes In My Heart，数学家们的故事非常有趣，也是给期末季添了一抹亮色！摘抄一点： A.Coble 是上个世纪美国的院士，做代数几何，一度很有影响。据称，他有无穷多个博士论文的题目：当你证明了一个 2 维的情况的时候，他叫下一个博士生去证明 3 维的情况，然后叫下下个博士生去做 4 维的。后来有个叫 Gerald Huff 的博士，不但做了 5 维的情况，而且对一般的 n 也解决了。这就让 Coble 的未来的无穷个博士无所事事了。Coble 很怒。 “未来的无穷个博士”莫名可爱。 Lindemann 到巴黎学习的时候，听过 Bertrand 和 Jordan 的课，当时学数学的人太少，尽管 Jordan 在法国算是领袖级的数学家，听他的课的人只有 3 个，偶尔会达到 4 个，其中却有一人是因为教室里暖和。 嗯，感觉跟我们的机器学习课一样，只有一半的人来听课，其中又有一半在做自己的事情，来是因为有空调…… 一次， Lebesgue 打电话（那个时候有电话，大概很富有了）给 Montel 讨论一个事情，两个人各持己见，吵了一个小时（那个时候的电话怎么收费？）也没有结果；第二天早上， Lebesgue 又给 Montel 打了一个电话，说我开始同意你的说法了，然而 Montel 说我也同意你的了，于是又开始争吵。","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"https://tsai-shiyuan.github.io/tags/%E6%97%A5%E8%AE%B0/"}]},{"title":"神奇又平凡的语言——《语言本能》读书笔记","slug":"250608-language-instinct-note","date":"2025-06-08T06:48:05.000Z","updated":"2025-06-11T01:45:21.114Z","comments":true,"path":"2025/06/08/250608-language-instinct-note/","permalink":"https://tsai-shiyuan.github.io/2025/06/08/250608-language-instinct-note/","excerpt":"","text":"引言 关于语言的起源和本质，存在着两个主流的观点——文化创造论和语言本能论。 文化创造论的核心思想是，语言是人类文化的产物，是逐渐演化出来的交流工具，而非生物进化的结果。人类并没有天生的语言能力，语言之所以能学会，是因为人类有强大的一般智能和学习能力。 而在乔姆斯基和本书的作者平克等人的世界观里，语言是人类与生俱来的能力，先天基因搭好了大脑网络的语言框架。乔姆斯基认为，儿童必然拥有某种先天机制，它符合世界上所有语言的语法原则，即所谓的“普遍语法”。平克的观点在《语言本能》一书中，观点非常有趣，论证也非常精彩。 语言本能论 支持语言本能论的证据有学习的不可能性，似乎只有先天基因搭好了框架，只预留出一些参数的自由度，通过后天输入来优化，才有可能学会语言。例子有Gavagai难题。 Gavagai难题的表述是这样的。假设你到了一个新部落，你并不懂他们的语言，这时一只兔子飞奔而过，土著指着兔子大喊“Gavagai”。几乎所有人都能立刻推断出这个词指的是兔子。但为什么Gavagai不是毛茸茸的东西、飞奔的兔子、兔脚？ 不知何故，婴儿总是能够排除不计其数的、在逻辑上同样成立的其他选项，直觉般地了解一个单词的正确含义。他们能够通过观察数量有限的某类事件，成功地对未来所有同类事件做出正确的概括，同时将与最初观察结果并不矛盾的无数错误概括排除在外。这是为什么呢？ 如果没有大脑对语言的大量预设，是无法靠预料输入来习得语言的。但是上面这一论证是有弱点的，Gavagai难题揭示的似乎不只是语言学习的不可能性，而是学习本身的不可能性。如果把这作为先天预设的证据，那么我们提前写在大脑的逻辑和本能数量就是非常巨大的，当然事实也可能是这样的。 另外，儿童真的只是凭“直觉”判断出词语的含义的吗？有没有可能，一个年龄尚小的儿童就已经拥有了相当丰富的语言经验呢？ 为什么一个三岁儿童能准确地识别物体？因为这个儿童看到的数据足够多！如果把孩子的眼睛看作是生物照相机，那他们每200毫秒就拍一张照，所以到3岁大的时候，一个孩子已经看了上亿张真实世界的图片。深度学习就用了这个思想，用足够大的数据集、配合高容量的模型，在没有明确规则指导的前提下，也能“学会”语义和物体识别。这种思路强调的并不是“先天语法”，而是统计意义上的归纳能力。而且从当前的大模型的语言能力来看，我觉得这一点是完全可能的。（虽然有时候并不合乎逻辑，但大体是通顺的。） 所以另一个观点也可以很好地解释这个学习不可能性这个论据：人类并不需要内置全部语言规则，只需要具备从复杂数据中提取结构的能力。 相比之下，我觉得语言的克里奥尔化现象更能证明语言本能论。 皮钦语（不同种族的劳工为了沟通而发明出的临时用语，缺乏既定的语法）也可以在很短的时间内转化为一种完整、复杂的语言，只要将一群正开始学习母语的孩子放到皮钦语的环境中就行。这种情况往往发生在从小离开父母、并由使用皮钦语的人照顾的孩子中。这些孩子并不满足于简单地重复这种支离破碎、片断式的语言形式，他们往往会注入前所未有的复杂语法，从而创造出一种具有丰富表现力的崭新语言。这种语言被称为“克里奥尔语”。 克里奥尔现象中的儿童并不是从大人的支离破碎的语句中被动地学习语言，而是主动构建语法，而且新语法比原语法更好。深度学习模型需要庞大输入才能学习语言，但孩子们在糟糕输入下仍然填补语法缺口，发展出完整语言系统，这表明语言能力并非靠数据的堆积，而是来自“本能”的强力驱动。仅用归纳能力和文化创造论不能很好地解释。 心语：思维的语言 初高中的时候做一些阅读题，论点是语言未来时态标记影响储蓄行为。英语等“强未来时标记”的语言，必须明确区分现在和未来时态，这种语法结构可能潜意识中将“未来”与“现在”割裂，导致未来事件在心理上显得更遥远，从而降低储蓄意愿。论据是使用无未来时标记语言的国家（如中国），国民储蓄率平均比强未来时标记语言国家高。 所以我以前是觉得语言是对思维有影响的。但是《语言本能》里面平克分析了“爱斯基摩语有关雪的词语更多”这个论断： 爱斯基摩人用来表示“雪”的词语多达几十个。言下之意非常明显：现实世界中的各种基本范畴并非客观存在，它们是文化强行输入的结果。 它违背了常识，但大家却深信不疑，因为每个人都觉得自己似乎在某个地方听到过它，而且它似乎蕴含着某种启示。 与人们的普遍看法相反，爱斯基摩语中有关“雪”的词语并不比英语多。 我又想了一下，之前我看到的观点其实经不起推敲，国家的经济水平等其他因素也可能导致国民储蓄率的参差。语法结构的差异不等同于思维差异。那语言和思维有什么关系呢？ 人们很容易高估语言的能力，以为语言决定着我们的思维。实际上，语言不是思维的唯一方式。心智计算理论是认知科学的基础，无论是英语还是其他任何自然语言，都不能用作心智计算的介质。心语，才是思维的语言。 平克认为，语言并不决定思维，也不是思维的唯一方式。书中举了三个思维独立于语言的例子：第一个是婴儿，在未建立起语言系统之前就对数字敏感；第二是猴子，无法掌握语言，自然不能用语言思考，但却能根据叫声或者图像识别某只猴子的身份；第三是关于艺术家和科学家的，他们灵感爆发时，思维不再依靠语言，而是一幅幅“心象”。在日常生活中也能感受到一些，比如写数学题的时候，不是用自然语言思考的，而是用数学符号和图像。 比较有意思的是平克提了一个“在‘语言影响思维’的问题上，唯一引人注目的发现”，他说英文具有虚拟语气，比如 If John were to go to the hospital, he would meet Mary，这种语气可以很好地描述反事实的情形，但是汉语的语法特征使得其使用者无法轻易分辨出想象中的虚假世界。同样的情形用汉语描述是这样的： 相比之下，汉语就缺乏虚拟语气以及其他直接表示反事实的语法结构，因此表达起来颇为曲折，例如：“如果约翰去了医院——但他其实没去——但如果他去了，他就会碰到玛丽。” 我们可以很容易地发现中文也有直接表达类似的意思的句子，比如“如果当时约翰去了医院，他就会碰到玛丽”。或许是对中文的不了解，或许是对自己习惯语言根深蒂固的语法形式的认知限制，平克，一位语言学家，在不经意间流露出了偏见。 但这个反面例子却恰好证明了只用语言呈现出来的内容去判断人的思维是会产生偏差的。思维独立于语言，有自身的“心语”，语言更像是思维优秀的材料来源和理想的输出工具，而非思维本身。 结语 读了《语言本能》，我对每天习以为常的语言有了更多了解。我们只需要张开口，发出一些声响，就可以在彼此头脑间传递准确、可靠的新想法。语言真奇妙！ 在人类语言巨浪中，还产生了像ChatGPT和DeepSeek这样的大模型，凭借语言的形状，模仿人类思维的路径。它们不“思考”，却能“说出”；未曾“意识”，却能“表述”（这是GPT自己说的）。这也提醒我们：语言可以生成世界，却不等同于世界；语言可指向思想，却并不等于思想本身。 语言是我们编织世界的方式，也是我们彼此触碰灵魂的桥梁。而理解语言的本能，便是在理解我们自己。","categories":[],"tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"https://tsai-shiyuan.github.io/tags/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}]},{"title":"250606-一门非常喜欢的课","slug":"250606-favorite-course","date":"2025-06-06T11:56:33.000Z","updated":"2025-06-08T08:03:14.469Z","comments":true,"path":"2025/06/06/250606-favorite-course/","permalink":"https://tsai-shiyuan.github.io/2025/06/06/250606-favorite-course/","excerpt":"","text":"信号处理与信息推断是刘雪峰老师开设的一门课程，课程讲了贝叶斯公式以及其在生活中的应用，老师说希望我们建立起批判性思维。在一众专业课中，这门教批判性思维的课显得格格不入，但却更因此深入人心。 这门课（连带当天晚上的语义学）就像是我心灵的自留地，带给我的太多了。就我自己来说，我以前看待一个人是典型的黑白思维，我如果给一个人贴上标签，我只会不断地去找证据证明他具有这个特点，而忽视其他的特点。但学了贝叶斯，我知道事物不是非黑即白的，是多面的；学了奥卡姆剃刀，更进一步，世界上没有那么多恶意，更大的可能是无意的。我以前也特别容易相信一些文章，常常觉得哪哪都挺有道理的啊，现在看一些帖子，我说“诶这个证据来源不可靠啊，我不信”、“诶这两者之间没啥关系啊，我不信”，这是我的成长吧。我一直有一种感觉，觉得自己&quot;better at reading books than at reading people&quot;，这门课告诉我我应该去read life，做一个更真实，更清醒，更温柔的人。 精心设计的“课后加餐”环节也告诉我，要做自己喜欢的事情，先收集珍珠，再把珍珠串起来；很多事情是命中注定，但是我们可以凭借自己的努力增加好事发生的概率，所谓“谋事在人，成事在天”；年轻的时候不妨大胆些，才能从局部最优解跳到全局最优解，像模拟退火一样；多任务学习，课本知识和工作技能都应该有所掌握，工作技能包括表达能力、理解能力、分析和解决问题的能力；基于模型共性迁移学习；寻找人生的幸福，我们的目标是，让自己的“体验感”更好，通过努力达到某个成就 / 对共同体的贡献 / 我生活中的点滴 / 临终体验感；热爱生活，“惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无尽，用之不竭。是造物者之无尽藏也，而吾与子之所共适”；照顾好自己的身体，然后照顾好自己的精神，然后照顾好家人，还有余力为国家和社会作出贡献……这些insight就像一颗颗珍珠，试着用他们优化我的未来。 这里我想记一下老师在课程的最后几分钟说的话： 世界并非只有简单的黑白色。世上一切人和事都有着漫长的光谱。这里面藏着固执、偏见、漠视、抉择和希翼。山那边是山吗？脑海中未知之地是否还有不明信息的脉搏？回到认知最开始的地方，乘思维之毯，越过山海、穿透迷雾，穷目之所及。寻找、发现、探索。山如是，水如是，人性的复杂如是，自然的真实如是，世界的绚烂亦如是。 人间清醒的意义是什么呢？ 你当然可以做一个温顺的孩子、听话的员工、合群的父母，你可以“过得去”。但你会发现，老了的时候，说不出自己活了什么；痛苦的时候，只能怪命不好、人太坏。你人生的节奏，永远是被外部安排，自己实际上从未参与。因此，认知升级，保持清醒，不是为了让你更优越，不能让你躺赢，而是让你可以剥掉幻觉、直面代价、找到内心真实的方向，让你更自由。 你可以看穿规则，但不必时时揭穿它；你可以戳穿幻觉，但也别急着粉碎别人的梦；你可以不说，但是在关键时刻，你要展现你的勇气和决断。我们清醒地活着，不是去审判世界，而是理解世界后，既拥有内心持久的宁静，也依然充满热爱生活的能力。 而且，你会慢慢明白，不是每个人都有你这样的条件可以接受好的教育；不是每个人都有你这样的见解；每个人追求的目标不同，手段不同，别人这么想这么做，是有他们自己的道理的。你开始变得理解他人了。 真正的英雄，是那些能看透这个世界，但仍然无限热爱它的人。 而我，也在学着成为那样的人。","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"https://tsai-shiyuan.github.io/tags/%E6%97%A5%E8%AE%B0/"}]},{"title":"250420","slug":"250420","date":"2025-04-20T02:12:42.000Z","updated":"2025-06-05T11:00:17.347Z","comments":true,"path":"2025/04/20/250420/","permalink":"https://tsai-shiyuan.github.io/2025/04/20/250420/","excerpt":"","text":"今天是第八周的周日，至此，学期恰好过半。 昨天记录了一下OS Lab3花的时间，一天下来学习OS的时间只有6.83小时，其余就1.5个小时写离散作业。真正学习的时间比我想象中少好多呀。不过好歹是把Lab3学完了。 还是有做得很好的地方滴。比如OO课，在电梯月里，写了影子电梯和评测机，体验感满满。在电梯单元，我是幸运的，公测时总能测出我的全部bug。我觉得，这份幸运，是有努力的加成的，如果没写极其高效的影子电梯，或许就会因为运行时间比较长而看不出结束的问题。 理想的状态是xv6 guide这样: Don’t start a lab the night before a lab is due; it much more time efficient to do the labs in several sessions spread over multiple days. The manifestation of a bug in operating system kernel can be bewildering and may require much thought and careful debugging to understand and fix.","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"https://tsai-shiyuan.github.io/tags/%E6%97%A5%E8%AE%B0/"}]},{"title":"250404-Who Knows","slug":"250404-who-knows","date":"2025-04-04T14:38:57.000Z","updated":"2025-04-11T13:29:31.970Z","comments":true,"path":"2025/04/04/250404-who-knows/","permalink":"https://tsai-shiyuan.github.io/2025/04/04/250404-who-knows/","excerpt":"","text":"I think there’s something more Life’s worth living for Who knows what could happen Do what you do Just keep on laughing One thing’s true There’s always a brand new day Who Knows by Avril Lavigne 🩵","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"https://tsai-shiyuan.github.io/tags/%E6%97%A5%E8%AE%B0/"}]},{"title":"250401","slug":"My-new-post","date":"2025-04-01T12:17:40.000Z","updated":"2025-04-01T14:50:23.889Z","comments":true,"path":"2025/04/01/My-new-post/","permalink":"https://tsai-shiyuan.github.io/2025/04/01/My-new-post/","excerpt":"","text":"新开一个日记本～影子电梯?","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"https://tsai-shiyuan.github.io/tags/%E6%97%A5%E8%AE%B0/"}]}],"categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"https://tsai-shiyuan.github.io/tags/%E6%97%A5%E8%AE%B0/"},{"name":"读书笔记","slug":"读书笔记","permalink":"https://tsai-shiyuan.github.io/tags/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}]}